{
    "CS": {
        "CS0004": {
            "className": "INTRODUCTION TO COMPUTER PROGRAMMING-BASIC",
            "classNumber": "0004",
            "coreq": [],
            "credits": "3 units",
            "description": "This is a first course in computer science.  It is designed to be of special interest to students majoring in one of the social sciences or humanities.  Objectives of this course include use of the computer in an interactive environment; problem analysis and the development of algorithms; learning the basic language; designing; coding; and documenting programs using techniques of good programming style.",
            "id": "CS0004",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS0007": {
            "className": "INTRODUCTION TO COMPUTER PROGRAMMING",
            "classNumber": "0007",
            "coreq": [],
            "credits": "3 units",
            "description": "This is a first course in computer science programming.  It is recommended for those students intending to major in computer science who do not have the required background for cs 0401.  It may also be of interest to students majoring in one of the social sciences or humanities.  The focus of the course is on problem analysis and the development of algorithms and computer programs in a modern high-level language.",
            "id": "CS0007",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0008": {
            "className": "INTRODUCTION TO COMPUTER PROGRAMMING WITH PYTHON",
            "classNumber": "0008",
            "coreq": [],
            "credits": "3 units",
            "description": "This is course is designed as a first course in computer science programming.  It is recommended for those students majoring in one of the natural sciences, social sciences, or humanities who wish to learn the fundamentals of programming.  It is also useful to students intending to major in computer science who do not have the required background for CS 0401.  The focus of this course is on problem analysis, the development of algorithms and computer programs in python. Instruction will be provided to students interested in taking CS 401 in converting python programs to Java.",
            "id": "CS0008",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0010": {
            "className": "INTRODUCTION TO COMPUTING FOR SYSTEMS ENGINEERS",
            "classNumber": "0010",
            "coreq": [],
            "credits": "4 units",
            "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution).  CS 0010 in particular will focus on problems related to IoT and engineering. Students will be required to purchase a Raspberry Pi and sensors in order to complete the projects and labs assigned throughout the course.",
            "id": "CS0010",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0011": {
            "className": "INTRODUCTION TO COMPUTING FOR SCIENTISTS",
            "classNumber": "0011",
            "coreq": [],
            "credits": "4 units",
            "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution). CS 0011 in particular will focus on problems related to the natural sciences with an emphasis on computational biology. Domain-specific projects and labs will be assigned throughout the course to encourage students in the natural sciences to apply computing to their field of study.",
            "id": "CS0011",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0012": {
            "className": "INTRODUCTION TO COMPUTING FOR THE HUMANITIES",
            "classNumber": "0012",
            "coreq": [],
            "credits": "4 units",
            "description": "All of the CS 001X courses will introduce students to the concepts of computing and computer programming. Students in these courses will learn how a computer works and how to write programs in order to use the computer as a problem solving tool. A major focus of the class will be on developing problem-solving skills (e.g., how to decompose a problem into more manageable parts and how to combine those parts into an overall solution). CS 0012 in particular will focus on problems related to the humanities and allied social sciences. Domain-specific projects and labs will be assigned throughout the course to encourage students in these fields to apply computing to their studies.",
            "id": "CS0012",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0134": {
            "className": "WEB SITE DESIGN AND DEVELOPMENT",
            "classNumber": "0134",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will provide a basic understanding of the methods and techniques of developing a simple to moderately complex web site.  Using the current standard web page language, students will be instructed on creating and maintaining a simple web site.  After the foundation language has been established, the aid of an internet editor will be introduced.  A second web-based language will be included to further enhance the web sites.",
            "id": "CS0134",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS0334": {
            "className": "INTERMEDIATE WEB SITE DESIGN AND DEVELOPMENT",
            "classNumber": "0334",
            "coreq": [],
            "credits": "3 units",
            "description": "The course will consist of advanced implementations of both markup as well as scripting languages. In addition, students will be introduced to a graphical interface application that will allow them to explore concepts of server side web development. A reflective programming language and database application will be used to introduce the server side web development concepts.",
            "id": "CS0334",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0007 or 0134 or 0401 or INFSCI 0017 (Min Grade 'C' or Transfer)"
            ],
            "recitation": false
        },
        "CS0401": {
            "className": "INTERMEDIATE PROGRAMMING USING JAVA",
            "classNumber": "0401",
            "coreq": [],
            "credits": "4 units",
            "description": "This course is a rigorous introduction to the fundamental concepts and techniques of computer programming using the java programming language.  This is a first course for students who intend to major in computer science.",
            "id": "CS0401",
            "major": "CS",
            "prereq": [],
            "recitation": true
        },
        "CS0441": {
            "className": "DISCRETE STRUCTURES FOR CS",
            "classNumber": "0441",
            "coreq": [],
            "credits": "3 units",
            "description": "The purpose of this course is to understand and use (abstract) discrete structures that are backbones of computer science.  In particular, this class is meant to introduce logic, proofs, sets, relations, functions, counting, and probability, with an emphasis on applications in computer science.",
            "id": "CS0441",
            "major": "CS",
            "prereq": [
                "CREQ: MATH 0220 or 0230 or 0235 or 0140 (Min Grade 'C' or Transfer) or (Plan: CS-MN or CSCI-MN and MATH 0120)"
            ],
            "recitation": true
        },
        "CS0445": {
            "className": "DATA STRUCTURES",
            "classNumber": "0445",
            "coreq": [],
            "credits": "3 units",
            "description": "This course emphasizes the study of the basic data structures of computer science (stacks, queues, trees, lists) and their implementations using the java language included in this study are programming techniques which use recursion, reference variables, and dynamic memory allocation.  Students in this course are also introduced to various searching and sorting methods and also expected to develop an intuitive understanding of the complexity of these algorithms.",
            "id": "CS0445",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0401 or COE 0401 or 0422 or CIST 0150 (MIN GRADE 'C' or Transfer)"
            ],
            "recitation": true
        },
        "CS0447": {
            "className": "COMPUTER ORGANIZATION AND ASSEMBLY LANGUAGE",
            "classNumber": "0447",
            "coreq": [],
            "credits": "3 units",
            "description": "The purpose of this course is to study the components of computing systems common to most computer architectures.  In particular, this class is meant to introduce data representation, types of processors, memory types and hierarchy, and device drivers.  The students will learn MIPS assembly language, the design of arithmetic and logic units, and basic designs for RISC processors.",
            "id": "CS0447",
            "major": "CS",
            "prereq": [
                "CREQ: CS 0445 or COE 0445 or 0458 (Min Grade 'C' or Transfer)"
            ],
            "recitation": true
        },
        "CS0449": {
            "className": "INTRODUCTION TO SYSTEMS SOFTWARE",
            "classNumber": "0449",
            "coreq": [],
            "credits": "3 units",
            "description": "This course covers topics related to the interface of hardware and software.  It covers device interfaces and hardware synchronization at the lowest level of the operating system, the linkage of operating system services to application software, and the fundamental mechanisms for computer communications.",
            "id": "CS0449",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0445 or CS 0455 (Min Grade 'C' or Transfer); CREQ: CS 0447 or CS 0456 or COE 0447 or COE 0147"
            ],
            "recitation": true
        },
        "CS0590": {
            "className": "SOCIAL IMPLICATIONS OF COMPUTING TECHNOLOGY",
            "classNumber": "0590",
            "coreq": [],
            "credits": "3 units",
            "description": " ",
            "id": "CS0590",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0002 or 0003 or 0004 or 0007 or 0008 or 0015 or 0101 or 0401 or COE 0401 (Min Grade 'C' or Transfer for All Listed Courses)"
            ],
            "recitation": false
        },
        "CS1501": {
            "className": "ALGORITHM IMPLEMENTATION",
            "classNumber": "1501",
            "coreq": [],
            "credits": "3 units",
            "description": "The course covers a broad range of the most commonly used algorithms:  some examples include algorithms for sorting, searching, encryption, compression, and local search.  The students will implement and test several algorithms.  The course is programming intensive.",
            "id": "CS1501",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0441 or CS 0406) and (CS 0445 or CS 0455 or COE 0445) ; (MIN GRADE 'C'  or Transfer FOR ALL COURSES LISTED)"
            ],
            "recitation": true
        },
        "CS1502": {
            "className": "FORMAL METHODS IN COMPUTER SCIENCE",
            "classNumber": "1502",
            "coreq": [],
            "credits": "3 units",
            "description": "The course is an introduction to the theory of information and computation as a physical phenomenon. The course covers standard formalizations of computational concepts and proofs of noteworthy implications of these formalizations. Typical topics include: finite automata, computability, reducibility, and complexity.",
            "id": "CS1502",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0441 or CS 0406) and (CS 0445 or CS 0455 or COE 0445) ; (MIN GRADE C'  or Transfer FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1510": {
            "className": "ALGORITHM DESIGN",
            "classNumber": "1510",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will cover methods and strategies that are useful for the design of nonnumeric algorithms.  Students are expected to design their own algorithms.",
            "id": "CS1510",
            "major": "CS",
            "prereq": [
                "PREQ: [(CS 1501 or COE 1501) and CS 1502] or (CS 0458 and CS 1710); MIN GRADE 'C' or Transfer FOR ALL COURSES LISTED"
            ],
            "recitation": true
        },
        "CS1520": {
            "className": "PROGRAMMING LANGUAGE FOR WEB APPLICATIONS",
            "classNumber": "1520",
            "coreq": [],
            "credits": "3 units",
            "description": "Various programming paradigms will be studied using java and scripting languages.  The use of java in programming web based applications, network applications, and the use of the extensive java libraries will be studied.  The programming paradigm of building software by gluing components will be explored through the use of scripting languages such as perl and JavaScript.  Applications include developing guis and internet programming.",
            "id": "CS1520",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0445 or COE 0445; (MIN GRADE 'C' or Transfer)"
            ],
            "recitation": true
        },
        "CS1530": {
            "className": "SOFTWARE ENGINEERING",
            "classNumber": "1530",
            "coreq": [],
            "credits": "3 units",
            "description": "The purpose of this course is to provide a general survey of software engineering.  Some of the topics covered include: project planning and management, design techniques, verification and validation, and software maintenance.  Particular emphasis is on a group project in which a group of students implement a system from its specification.",
            "id": "CS1530",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0445 or COE 0445; (MIN GRADE 'C' or Transfer)"
            ],
            "recitation": false
        },
        "CS1541": {
            "className": "INTRODUCTION TO COMPUTER ARCHITECTURE",
            "classNumber": "1541",
            "coreq": [],
            "credits": "3 units",
            "description": "Examination of computer architecture and hardware system organization.  Topics include:  CPU organization, sequential and microprogrammed control, instruction set implementation, memory organizations, input/output structure, peripherals and computer communications.",
            "id": "CS1541",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0447 or COE 0447 or COE 0147) and (CS 0449 or COE 0449) ; (MIN GRADE 'C' or Transfer)"
            ],
            "recitation": false
        },
        "CS1550": {
            "className": "INTRODUCTION TO OPERATING SYSTEMS",
            "classNumber": "1550",
            "coreq": [],
            "credits": "3 units",
            "description": "An introduction to basic concepts of operating systems, common to most computer systems, which interfaces the machine with upper-level programs.  This course will introduce processes as processing unit, process management, concurrency, communication, memory management and protection, and file systems.",
            "id": "CS1550",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0447 or COE 0447 or COE 0147) and (CS 0449 or COE 0449) or (0456 and 1750); MIN GRADE 'C'  or TRANSFER FOR ALL COURSES LISTED"
            ],
            "recitation": true
        },
        "CS1555": {
            "className": "DATABASE MANAGEMENT SYSTEMS",
            "classNumber": "1555",
            "coreq": [],
            "credits": "3 units",
            "description": "The objective of this course is to provide an in-depth knowledge of database systems design. Thus, the emphasis is on how to model ones own data and how to use available database management systems effectively. Towards this end, the relational and the object-relational models are discussed in great detail and object-oriented and other data models are also presented. Commercial database management systems are examined and students get practical experience through the use of such systems.",
            "id": "CS1555",
            "major": "CS",
            "prereq": [
                "PREQ: CS 1501 (Min Grade 'C')"
            ],
            "recitation": true
        },
        "CS1566": {
            "className": "INTRODUCTION COMPUTER GRAPHICS",
            "classNumber": "1566",
            "coreq": [],
            "credits": "3 units",
            "description": "This course offers an in-depth exploration of fundamental concepts in 2d and 3d computer graphics. The bulk of the course is devoted to 3d modeling, geometric transformations, and 3d viewing and rendering.",
            "id": "CS1566",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0447 or 0456 or COE 0447 or COE 0147); (MIN GRADE 'C'  or TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1571": {
            "className": "INTRODUCTION TO ARTIFICIAL INTELLIGENCE",
            "classNumber": "1571",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will provide an introduction to the fundamental concepts and techniques underlying the construction of intelligent computer systems.  Topics covered in the course include:  problem solving and search, logic and knowledge representation, planning, reasoning and decision-making in the presence of uncertainty, and machine learning.",
            "id": "CS1571",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 1501 or COE 1501) and CS 1502 (Min Grade 'C' or Transfer for All Listed Courses)"
            ],
            "recitation": false
        },
        "CS1621": {
            "className": "STRUCTURE PROGRAMMING LANGUAGES",
            "classNumber": "1621",
            "coreq": [],
            "credits": "3 units",
            "description": "An analytical examination of modern high-level programming language structures; including design specification and implementation.  Advanced forms of data types, expressions, and control primitives.  Relationship of storage management techniques and language design.",
            "id": "CS1621",
            "major": "CS",
            "prereq": [
                "PREQ: CS (0441 and 0445) or (0406 and 0455); (MIN GRADE 'C' or TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1622": {
            "className": "INTRODUCTION TO COMPILER DESIGN",
            "classNumber": "1622",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will introduce the basic concepts of compiler design and implementation.  Topics include lexical analysis, various types of parsers, intermediate and object code generation and code optimization.  The material will be presented from an implementation point of view rather than a formal approach.  The impact of language design on compilers will also be examined.",
            "id": "CS1622",
            "major": "CS",
            "prereq": [
                "PREQ: CS 0441 and ((CS or COE 0447 or COE 0147) or (CS 0406 and 0456)); (MIN GRADE 'C'  OR TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1632": {
            "className": "SOFTWARE QUALITY ASSURANCE",
            "classNumber": "1632",
            "coreq": [],
            "credits": "3 units",
            "description": "This course provides students with a broad understanding of modern software testing and quality assurance. Although it will cover testing theory, the emphasis is on providing practical skills in software testing currently used in industry. To that end, it will cover: manual and automated tests, test-driven and behavior-driven development, performance testing, and understanding and developing a testing process.",
            "id": "CS1632",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0445 or COE 0445 or CS 0455) or (PLAN COE and (CS 0445 or COE 0445) (Min Grade 'C'  or Transfer for All Listed Courses)"
            ],
            "recitation": false
        },
        "CS1640": {
            "className": "BIOINFORMATICS SOFTWARE DESIGN",
            "classNumber": "1640",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will develop software for bioinformatic applications.",
            "id": "CS1640",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1645": {
            "className": "INTRODUCTION TO HIGH PERFORMANCE COMPUTING SYSTEMS",
            "classNumber": "1645",
            "coreq": [],
            "credits": "3 units",
            "description": "This course is an introduction to the architecture of and software techniques for parallel and high performance computing systems.  The content includes fundamental aspects of vector processing, shared-memory, and distributed-memory systems.  Specific applications in parallel processing paradigms will be covered.",
            "id": "CS1645",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0447 or COE 0447 or COE 0147) and (CS 0449 or COE 0449) and (CS 1501 or COE 1501); (MIN GRADE 'C' OR TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1652": {
            "className": "DATA COMMUNICATION AND COMPUTER NETWORKS",
            "classNumber": "1652",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will include basic principles and topics of computer communications.  An overview of interfaces that interconnect hardware and software components, describing the procedures and rules involved in the communication process and the software which controls computers communication. Discussion on network architectures, design principles, basic protocol suites, and the concept of internetworking.",
            "id": "CS1652",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0447 or COE 0447 or COE 0147) and (CS 0449 or COE 0449); (MIN GRADE 'C'  OR TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1653": {
            "className": "APPLIED CRYPTOGRAPHY AND NETWORK SECURITY",
            "classNumber": "1653",
            "coreq": [],
            "credits": "3 units",
            "description": "This course will provide the necessary conceptual background and hands-on experience to understand the most common cryptographic algorithms and protocols and how to use them to secure computers networks and distributed applications.  Topics include: cryptographic algorithms for data confidentiality, authentication, and integrity, user authentication methods (secure tokens and biometrics), internet security protocols, security in local area networks, firewalls, and intrusion detection systems.",
            "id": "CS1653",
            "major": "CS",
            "prereq": [
                "PREQ: (CS 0449 or COE 0449) and (CS 1501 or COE 1501) or (CS 0458 or CS 1750); (MIN GRADE 'C'  OR TRANSFER FOR ALL COURSES LISTED)"
            ],
            "recitation": false
        },
        "CS1656": {
            "className": "INTRODUCTION TO DATA SCIENCE",
            "classNumber": "1656",
            "coreq": [],
            "credits": "3 units",
            "description": "This course aims to expose students to different data management, data manipulation, and data analysis techniques. The class will cover all the major data management paradigms (relational/SQL, XML/Xquery, RDF/SPARQL) including NOSQL and data stream processing approaches. Going beyond traditional data management techniques, the class will expose students to information retrieval, data mining, data warehousing, network analysis, and other data analysis topics. Time permitting, the class will include big data processing techniques, such as the map/reduce framework.",
            "id": "CS1656",
            "major": "CS",
            "prereq": [
                "PREQ: CS 1501 or COE 1501 (MIN GRADE 'C' or Transfer For All Listed Coures)"
            ],
            "recitation": true
        },
        "CS1666": {
            "className": "PRINCIPLES OF COMPUTER GAME DESIGN AND IMPLEMENTATION",
            "classNumber": "1666",
            "coreq": [],
            "credits": "3 units",
            "description": "The purpose of this course is to give an introduction and insight into designing and implementing video games.  This course questions the nature, intent, and motivation of games and how to construct a compelling experience for users. It is a project-based course, with a final project being to make a game with a small team.",
            "id": "CS1666",
            "major": "CS",
            "prereq": [
                "PREQ: CS 1501 or COE 1501; (MIN GRADE 'C' or Transfer)"
            ],
            "recitation": false
        },
        "CS1674": {
            "className": "INTRODUCTION TO COMPUTER VISION",
            "classNumber": "1674",
            "coreq": [],
            "credits": "3 units",
            "description": "In this class, students will learn the basics of modern computer vision. The course will cover topics such as image filtering, edge detection, feature extraction, description and matching, grouping and clustering, object detection, activity recognition, and recognition with a human in the loop.",
            "id": "CS1674",
            "major": "CS",
            "prereq": [
                "PREQ: CS 1501 or COE 1501 (MIN GRADE 'C' OR TRANSFER)"
            ],
            "recitation": false
        },
        "CS1699": {
            "className": "SPECIAL TOPICS IN COMPUTER SCIENCE",
            "classNumber": "1699",
            "coreq": [],
            "credits": "3 units",
            "description": "This is a special topics course that allows the computer science department to test run a course before deciding whether to permanently add it to our curriculum.",
            "id": "CS1699",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1900": {
            "className": "INTERNSHIP",
            "classNumber": "1900",
            "coreq": [],
            "credits": "0",
            "description": "",
            "id": "CS1900",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1902": {
            "className": "DIRECTED STUDY",
            "classNumber": "1902",
            "coreq": [],
            "credits": "0",
            "description": "",
            "id": "CS1902",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1906": {
            "className": "COMPUTER SCIENCE COOPERATIVE PROGRAM",
            "classNumber": "1906",
            "coreq": [],
            "credits": "0",
            "description": "",
            "id": "CS1906",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1950": {
            "className": "DIRECTED RESEARCH",
            "classNumber": "1950",
            "coreq": [],
            "credits": "0",
            "description": "",
            "id": "CS1950",
            "major": "CS",
            "prereq": [],
            "recitation": false
        },
        "CS1980": {
            "className": "TEAM PROJECT DESIGN AND IMPLEMENTATION",
            "classNumber": "1980",
            "coreq": [],
            "credits": "3 units",
            "description": "Students will choose a project from proposals provided by our faculty and industry partners.  Teams will consist of 3 or 4 students and they will be supervised by a project mentor.  This course satisfies the capstone requirement.",
            "id": "CS1980",
            "major": "CS",
            "prereq": [],
            "recitation": false
        }
    }
}