{"nodes": [{"id": "CS-4", "prereqs": [], "description": "This is a first course in computer science. It is designed to be of special interest to students majoring in one of the social sciences or humanities. Objectives of this course include: a) The use of the computer in an interactive environment. b) Problem analysis and the development of algorithms. c) Learning the Visual Basic programming language. d) Designing, coding, and documenting programs.", "href": "/courses/view/CS-0004"}, {"id": "CS-7", "prereqs": [], "description": "This is a first course in computer science programming. It is recommended for those students intending to major in computer science who do not have the required background for CS 0401. It may also be of interest to students majoring in one of the social sciences or humanities. The focus of the course is on problem analysis and the development of algorithms and computer programs in a modern high-level language.", "href": "/courses/view/CS-0007"}, {"id": "CS-8", "prereqs": [], "description": "This is course is designed as a first course in computer science programming.  It is recommended for those students majoring in one of the natural sciences, social sciences, or humanities who wish to learn the fundamentals of programming.  It is also useful to students intending to major in computer science who do not have the required background for CS 0401.  The focus of this course is on problem analysis, the development of algorithms and computer programs in Python. Instruction will be provided to students interested in taking CS401 in converting Python programs to Java.", "href": "/courses/view/CS-0008"}, {"id": "CS-90", "prereqs": [], "description": "Are you really being as green as you thought? How can technology and the environment survive together? Choices in technology such as telecommuting, electronic books, social media, and cell phones may not be as green as you may think. Some of it is very good, and we will explore the good technology along with the bad. How can computing technology help achieve sustainability such as smart buildings and smart transportation systems. This will be a discussion-based course. Students will be encouraged to describe, interpret, and evaluate the impact of computer technology on the environment. Students will discuss articles, media, and other reflective information to uncover the positives and negatives of computers and technology on our world. As an introductory course, no prior computer experience is needed.", "href": "/courses/view/CS-0090"}, {"id": "CS-134", "prereqs": [], "description": "This course will provide a basic understanding of the methods and techniques of developing a simple to moderately complex web site. Using the current standard web page language, students will be instructed on creating and maintaining a simple web site. After the foundation language has been established, the aid of an internet editor will be introduced. A second web-based language will be included to further enhance the web sites.", "href": "/courses/view/CS-0134"}, {"id": "CS-155", "prereqs": [], "description": "This course is an Introduction to Data Science, designed as a first course in computer science, for non-CS majors and CS minors within the Honors College, aiming to introduce students to basic data management technologies and data analytics skills. The course will consist of about 1/3 of introduction to computer programming, 1/3 of introduction to data management technologies, and 1/3 of introduction to data analytics. The course will adopt the point of view of a user of data (e.g., who is just combining data and analyzing it using tools) and not a provider of data (e.g., who would be implementing a database-driven web site), as is typically be case for related courses for CS majors.", "href": "/courses/view/CS-0155"}, {"id": "CS-334", "prereqs": ["CS-7", "CS-134", "CS-401"], "description": "The course will consist of advanced implementations of both markup as well as scripting languages, in addition, students will be introduced to a graphical interface application that will allow them to explore concepts of server side web development. A reflective programming language and database application will be used to introduce the server side web development concepts.", "href": "/courses/view/CS-0334"}, {"id": "CS-401", "prereqs": [], "description": "This is an intermediate course focusing on object-oriented programming and other fundamental programming concepts utilizing the Java programming language. Students are expected to have some previous programming experience prior to taking this course.", "href": "/courses/view/CS-0401"}, {"id": "CS-441", "prereqs": [], "description": "The purpose of this course is to understand and use (abstract) discrete structures that are backbones of computer science. In particular, this class is meant to introduce logic, proofs, sets, relations, functions, counting, and probability, with an emphasis on applications in computer science.", "href": "/courses/view/CS-0441"}, {"id": "CS-445", "prereqs": ["CS-401"], "description": "This course emphasizes the study of the basic data structures of computer science (stacks, queues, trees, lists, graphs) and their implementations using the Java language. Included in this study are programming techniques which use recursion and reference variables. Students in this course are also introduced to various searching and sorting methods and are also expected to develop an intuitive understanding of the complexity of these algorithms.", "href": "/courses/view/CS-0445"}, {"id": "CS-447", "prereqs": ["CS-445"], "description": "The purpose of this course is to study the components of computing systems common to most computer architectures. In particular, this class is meant to introduce data representation, types of processors (e.g., RISC V. CISC), memory types and hierarchy, assembly language, linking and loading, and an introduction to device drivers.", "href": "/courses/view/CS-0447"}, {"id": "CS-449", "prereqs": ["CS-445"], "description": "This course will introduce the students to the important systems language, C, and to several topics related to the hardware and software environment. These are issues related to device interfaces and hardware synchronization at the lowest level of the operating system, the linkage of operating system services to application software, and the fundamental mechanisms for computer communications.", "href": "/courses/view/CS-0449"}, {"id": "CS-590", "prereqs": ["CS-4", "CS-7", "CS-8", "CS-401"], "description": "This course is intended to expose students to issues regarding the social and ethical implications of technology. In recent years, many computer professionals have become increasingly aware of the societal impacts of the increased use of computer technology in everyday life. While technology promises many benefits to our society and economy, there are also well founded concerns that serious problems may arise. This course is intended to introduce students to the main issues surrounding the computerization of society, and to help students understand the development, application, and consequences of information technology as social as well as technical processes. Topics include computerization and the quality of work life, unemployment, personal privacy and freedom of information, ownership and rights to software, and the manageability, risks and accountability of complex systems. The course seeks to foster in students a critical approach to the understanding of the impact of technology in society via the academic skills of reading, writing and argumentation. The course is designed to meet the program WRIT requirement for CS majors.", "href": "/courses/view/CS-0590"}, {"id": "CS-699", "prereqs": ["CS-7"], "description": "", "href": "/courses/view/CS-0699"}, {"id": "CS-1501", "prereqs": ["CS-441", "CS-445"], "description": "This course covers a broad range of the most commonly used algorithms. Some examples include algorithms for sorting, searching, encryption, compression and local search. The students will implement and test several algorithms. The course is programming intensive.", "href": "/courses/view/CS-1501"}, {"id": "CS-1502", "prereqs": ["CS-441", "CS-445"], "description": "The course is an introduction to the theory of information and computation as a physical phenomenon. The course covers standard formalizations of computational concepts and proofs of noteworthy implications of these formalizations. Typical topics include: finite automata, computability, reducibility, and complexity. [Effective 2164]", "href": "/courses/view/CS-1502"}, {"id": "CS-1510", "prereqs": ["CS-1501", "CS-1502"], "description": "This course will cover methods and strategies that are useful for the design of nonnumeric algorithms. Students are expected to design their own algorithms.", "href": "/courses/view/CS-1510"}, {"id": "CS-1511", "prereqs": ["CS-1502"], "description": "Understanding the theory of computation provides deeper insights into various topics in computer science. This is an introductory level theory course. The aim of this course is to study the power (or lack of it) of various models of computation. Topics to be covered include: computability theory, automata theory, and languages.", "href": "/courses/view/CS-1511"}, {"id": "CS-1515", "prereqs": ["CS-445"], "description": "Numerical methods used in scientific computation will be discussed, with particular reference to their data structuring and verification aspects. The methods will be selected from the following: solution of systems of linear equations, solution of non-linear equations, approximation, and solution of ordinary differential equations.", "href": "/courses/view/CS-1515"}, {"id": "CS-1520", "prereqs": ["CS-445"], "description": "Various programming paradigms will be studied using Java and scripting languages. The use of Java in programming web based applications, network applications, and the use of the extensive Java libraries will be studied. The programming paradigm of building software by gluing components will be explored through the use of scripting languages such as Perl and JavaScript. Applications include developing GUIs and internet programming.", "href": "/courses/view/CS-1520"}, {"id": "CS-1530", "prereqs": ["CS-445"], "description": "The purpose of this course is to provide a general survey of software engineering. Some of the topics covered include: project planning and management, design techniques, verification and validation, and software maintenance. Particular emphasis is on a group project in which a group of 4-5 students implement a system from its specification.", "href": "/courses/view/CS-1530"}, {"id": "CS-1538", "prereqs": ["CS-447"], "description": "This course introduces students to the concepts, definitions, and techniques applicable to the modeling and simulation of systems. Primary emphasis is on discrete systems, although continuous systems are also discussed. A major objective of the course is to familiarize the student with several important discrete simulation programming languages and to illustrate their uses in the modeling and simulation of various kinds of systems. Programming is carried out using CSIM. Topics include: systems characterization, classification, and model types; advantages and disadvantages of simulation studies; pertinence of probability and statistics to the representation of stochastic processes and non-deterministic behaviors in system models; different viewpoints and orientations in conducting system simulations; modeling tools and techniques used in selected simulation programming environments; validation and verification.", "href": "/courses/view/CS-1538"}, {"id": "CS-1541", "prereqs": ["CS-447", "CS-449"], "description": "Examination of computer architecture and hardware system organization. Topics include: CPU organization, sequential and microprogrammed control, instruction set implementation, memory organizations, input/output structure, peripherals and interfacing, and computer communications.", "href": "/courses/view/CS-1541"}, {"id": "CS-1550", "prereqs": ["CS-447", "CS-449"], "description": "The purpose of this course is to understand and use the basic concepts of operating systems, common to most computer systems, which interfaces the machine with the programmer. In particular, this class is meant to introduce processes such as the processing unit, process management, concurrency, communication, memory management and protection, and file systems.", "href": "/courses/view/CS-1550"}, {"id": "CS-1555", "prereqs": ["CS-441", "CS-445"], "description": "The objective of this course is to provide an in-depth knowledge of database systems design. Thus, the emphasis is on how to model ones own data and how to use available Database Management Systems effectively. Towards this end, the relational and the object-relational models are discussed in great detail and object-oriented and other data models are also presented. Commercial database management systems are examined and students get practical experience through the use of such systems.", "href": "/courses/view/CS-1555"}, {"id": "CS-1566", "prereqs": ["CS-447", "CS-447"], "description": "This course offers an in-depth exploration of fundamental concepts in 2D and 3D computer graphics. The bulk of the course is devoted to 3D modeling, geometric transformations, and 3D viewing and rendering.", "href": "/courses/view/CS-1566"}, {"id": "CS-1567", "prereqs": ["CS-441", "CS-445"], "description": "Students will be introduced to a variety of programming techniques and paradigms, for implementing medium- to large-scale software systems. System integration is done on a mobile robot platform rather than a traditional desktop system. However, this is not a course in robotics. It is a course about building systems in a real-world environment.", "href": "/courses/view/CS-1567"}, {"id": "CS-1571", "prereqs": ["CS-1501", "CS-1502"], "description": "This course will provide an introduction to the fundamental concepts and techniques underlying the construction of intelligent computer systems. Topics typically covered in the course include: problem solving and search, logic and knowledge representation, planning, reasoning and decision- making in the presence of uncertainty, and machine learning.", "href": "/courses/view/CS-1571"}, {"id": "CS-1573", "prereqs": ["CS-1501", "CS-1502"], "description": "This course is about using concepts of artificial intelligence to solve current, real-world problems. In particular, we will focus on the area of machine learning, which has brought advances to many fields of studies such as bioinformatics, computational linguistics, and economics. This course will give an overview of the models and algorithms used in modern machine learning, including (but not limited to) generalized linear models, multi-layer neural networks, and clustering.", "href": "/courses/view/CS-1573"}, {"id": "CS-1621", "prereqs": ["CS-441", "CS-445"], "description": "An analytical examination of modern high-level programming language structures, including design specification and implementation. Advanced forms of data types, expressions, and control primitives. Relationship of storage management techniques and language design.", "href": "/courses/view/CS-1621"}, {"id": "CS-1622", "prereqs": ["CS-441", "CS-447"], "description": "This course intoduces the basic concepts of compiler design and implementation. Topics include: lexical analysis, various types of parsers, intermediate and object code generation and code optimization. Material will be presented from an implementation point of view rather than from a formal approach. The impact of language design on compilers will also be examined.", "href": "/courses/view/CS-1622"}, {"id": "CS-1630", "prereqs": ["CS-1501", "CS-1520", "CS-1530", "CS-1550", "CS-1555", "CS-1566"], "description": "Software-System Design and Management is a software engineering course with particular emphasis on project management, usability testing, customer interviewing, specification of formal requirements, and oral communication. In addition to the focus on a team programming project, we discuss, debate, and think about the team software design and development process. The students learn how to effectively communicate orally - from pitching ideas to a project manager, to interviewing a customer, resolving conflict with another team member, giving feedback and presenting results.", "href": "/courses/view/CS-1630"}, {"id": "CS-1631", "prereqs": ["CS-441", "CS-445"], "description": "Construction of large computerized systems proceeds through the stages of requirements analysis and specification, in particular, methodologies for improving the reliability of specifications (executable specifications and system prototypes). Emphasis is on a group project in which 4-5 students specify an information control system.", "href": "/courses/view/CS-1631"}, {"id": "CS-1632", "prereqs": ["CS-441"], "description": "This course provides students with a broad understanding of modern software testing and quality assurance. Although it will cover testing theory, the emphasis is on providing practical skills in software testing currently used in industry. To that end, it will cover: manual and automated tests, test- driven and behavior-driven development, performance testing, and understanding and developing a testing process.\r\nThe course is project-oriented, with students working in groups on specific deliverables on various software products, as would be expected in an industry setting.", "href": "/courses/view/CS-1632"}, {"id": "CS-1635", "prereqs": ["CS-445"], "description": "In this course, you will learn essential skills on designing, prototyping and evaluating mobile applications. Key topics of this course include - state-of-the-art mobile interfaces and interaction technologies,  How to design and implement effective applications for the small screen, with limited I/O modalities for people with limited time and attentions etc.", "href": "/courses/view/CS-1635"}, {"id": "CS-1640", "prereqs": ["CS-1501"], "description": "This course will develop software for bioinformatic applications. This course is restricted to Bioinformatics majors only.", "href": "/courses/view/CS-1640"}, {"id": "CS-1645", "prereqs": ["CS-447", "CS-449", "CS-1501"], "description": "This course is an introduction to the architecture of and software techniques for parallel and high performance computing systems. The content includes fundamental architecture aspects of shared-memory and distributed-memory systems, as well as paradigms, algorithms and languages used to program parallel systems. Students will complete a number of projects demonstrating specific applications on parallel processing systems.", "href": "/courses/view/CS-1645"}, {"id": "CS-1651", "prereqs": ["CS-1550"], "description": "Operating systems are fundamental to all modern computers. These systems are characterized by a wide range of functionality and complexity. All variants, however, use a core set of ideas. The purpose of the course is to discuss issues of fundamental importance in the design of operating systems. The subjects discussed include processes, semaphores, monitors, interprocess communication, scheduling, memory management, paging, segmentation, file systems, security and protection mechanisms. The objective of the course is to provide a clear understanding of these key problems and bring awareness of the known solutions to these problems and to the limitations of these solutions.", "href": "/courses/view/CS-1651"}, {"id": "CS-1652", "prereqs": ["CS-447", "CS-449"], "description": "The course emphasizes basic principles and topics of computer communications. The first part of the course provides an overview of interfaces that interconnect hardware and software components, describes the procedures and rules involved in the communication process and most importantly the software which controls computers communication. The second part of the course discusses network architectures and design principles, and describes the basic protocol suites. The third part of the course introduces the concept of internetworking, a powerful abstraction that deals with the complexity of multiple underlying communication technologies.", "href": "/courses/view/CS-1652"}, {"id": "CS-1653", "prereqs": ["CS-449", "CS-1501"], "description": "The goal of this course is to provide students the necessary conceptual background and hands-on experience to understand the most common cryptographic algorithms and protocols and how to use them to secure distributed applications and computer networks.", "href": "/courses/view/CS-1653"}, {"id": "CS-1655", "prereqs": ["CS-441", "CS-445"], "description": "The main objectives for this course are: (1) To study in more depth query optimization and security, (2) To study advanced topics: data mining, information retrieval, and web data management, and (3) to expose students to advanced data and information management technologies, while gaining hands-on experience. These include mobile data management, continuous queries and their applications in areas such as biomedical informatics and E-Commerce.", "href": "/courses/view/CS-1655"}, {"id": "CS-1656", "prereqs": ["CS-1501"], "description": "This course aims to expose students to different data management, data manipulation, and data analysis techniques. The class will cover all the major data management paradigms (Relational/SQL, XML/XQuery, RDF/SPARQL) including NoSQL and Data Stream Processing approaches. Going beyond traditional data management techniques, the class will expose students to information retrieval, data mining, data warehousing, network analysis, and other data analysis topics. Time-permitting, the class will include Big Data processing techniques, such as the map/reduce framework.", "href": "/courses/view/CS-1656"}, {"id": "CS-1666", "prereqs": ["CS-1501"], "description": "The purpose of this course is to give an introduction and insight into designing and implementing video games.   This course questions the nature, intent, and motivation of games and how to construct a compelling experience for users. It is a project-based course, with a final project being to make a game with a small team. [Effective 2174]", "href": "/courses/view/CS-1666"}, {"id": "CS-1671", "prereqs": ["CS-1501", "CS-1502"], "description": "This course provides an introduction to the field of natural language processing (NLP) - The creation of computer programs that can understand, generate, and learn languages used by humans. It will expose students to real-world applications such as speech recognition, information retrieval, dialogue agents, question answering systems, and machine translations by means of computational techniques including search algorithms, dynamic programming, hidden markov models, probalistic context free grammars, and related machine learning algorithms.", "href": "/courses/view/CS-1671"}, {"id": "CS-1674", "prereqs": ["CS-1501"], "description": "In this class, students will learn the basics of modern computer vision. The course will cover topics such as image filtering, edge detection, feature extraction, description and matching, grouping and clustering, object detection, activity recognition, and recognition with a human in the loop.", "href": "/courses/view/CS-1674"}, {"id": "CS-1675", "prereqs": ["CS-1501"], "description": "This introductory machine learning course will give an overview of many models and algorithms used in modern machine learning including linear models, multi-layer neural networks, support vector machines, density estimation methods, Bayesian belief networks, clustering, ensemble methods, and reinforcement of learning. The course will give the student the basic ideas and intuition behind these methods as well as a more formal understanding of how and why they work. Through homework assignments students will have an opportunity to experiment with many machine learning techniques and apply them to various real-world datasets.", "href": "/courses/view/CS-1675"}, {"id": "CS-1699", "prereqs": [], "description": "", "href": "/courses/view/CS-1699"}, {"id": "CS-1900", "prereqs": ["CS-449", "CS-1501"], "description": "A student may register their internship for their Capstone experience through the Department of Computer Science CS 1900 course. This course is designed to provide CS majors with real world work experience (through qualified outside companies). In addition to the work itself, which must be highly technical in nature and relevant to the CS degree, a CS internship also has an academic component consisting of regular meetings with a faculty sponsor, weekly meetings with all capstone students, and several papers and presentations.", "href": "/courses/view/CS-1900"}, {"id": "CS-1902", "prereqs": [], "description": "This course is designed to give students the opportunity to design a plan of study to be agreed upon by the student and a supervising faculty member. This course is variable credits (1-3) as agreed upon by the supervising faculty member and student. This course does NOT count toward any CS requirements but can count toward credits required for graduation.", "href": "/courses/view/CS-1902"}, {"id": "CS-1906", "prereqs": [], "description": "Through the assistance of the School of Engineering's Cooperative Education Office, formal arrangements are established with industry that permit students to rotate four-month terms between the workplace and the classroom. At the University of Pittsburgh, this rotation begins after the completion of the sophomore year, and extends into the senior year, with the Co-op student completing at least two four-month work rotations. These rotations, which are typically but not necessarily with the same employer, allow job duties to increase as the knowledge and skills of the student progress.\r\n\r\nCompletion of at least 2 four-month Co-op rotations and a summary paper can be used by a Computer Science major to satisfy the Capstone graduation requirement. However, the Co-op does not count in place of any regular Computer Science courses.\r\n\r\nIn addition to receiving an \"S\" grade for at least two co-op rotations, students using their cooperative education experience for their capstone requirement must complete an 8-10 page paper as the final requirement. This paper must be completed in the term following your final co-op rotation. \r\n\r\nThe topic should be an examination / explanation of your co-op both from a technical point of view (projects you did, things you learned, etc) and from an experiential point of view (workplace issues, organization, etc).\r\n\r\nNote: Students cannot graduate in a co-op semester.", "href": "/courses/view/CS-1906"}, {"id": "CS-1950", "prereqs": [], "description": "This course is designed to give students the opportunity to design a plan of study to be agreed upon by the student and a supervising faculty member. This course must be taken for three (3) credits to satisfy the computer science capstone requirement. \r\nBioinformatics students can take the course for 1-3 (typically 2) credits.", "href": "/courses/view/CS-1950"}, {"id": "CS-1980", "prereqs": ["CS-1501", "CS-1550"], "description": "CS 1980 (was 1680) is a projects-oriented course. Students work in teams of 3 or 4 on a project chosen from a list of projects proposed by our industry partners (Alcoa, CEI, Compunetix, Eli Lily) and/or faculty. Teams will work closely with their industry mentor or faculty mentor in order to complete the project in a timely manner. Students must be prepared to work on average about 10 hours a week on their project", "href": "/courses/view/CS-1980"}, {"id": "CS-1981", "prereqs": ["CS-1501", "CS-1550"], "description": "This course is designed as a practicum for computer science as both a way to build software of industrial stregnth and a way to interact with an industrial partner. Software engineering concepts (e.g., Scrums, code-sharing repositories, testing, quality assurance, etc) will be used while spending time on design, algorithms, security, reliability, and networking. Input data as well as metrics will be systematically examined in order to compare implementations in a qualitative and quantitative way. This course satisfies the Computer Science Capstone requirement.", "href": "/courses/view/CS-1981"}, {"id": "CS-2000", "prereqs": [], "description": "Master's thesis research. Credits between 1-9 inclusive.", "href": "/courses/view/CS-2000"}, {"id": "CS-2001", "prereqs": ["CS-2000"], "description": "This course introduces the students to the research being conducted in the Computer Science Department. The course consists of a number of modules, each spanning between two and four classes and covering an active, state-of-the-art, research topic. Tests, homeworks and/or projects will be integrated in each module. The students will be graded in each module independently and the final grade of a student will depend on his/her grades in all the modules. All first year Ph.D. students are required to take this course, which is open to all Computer Science graduate students.", "href": "/courses/view/CS-2001"}, {"id": "CS-2002", "prereqs": ["CS-2001"], "description": "In this course, each student will perform exploratory research related to two of the modules covered in CS 2001. The research will be supervised and directed by faculty members working in the area of the modules chosen by the student.", "href": "/courses/view/CS-2002"}, {"id": "CS-2003", "prereqs": [], "description": "THE COMPUTER SCIENCE COLLOQUIUM IS OFFERED AS A ONE UNIT GRADUATE CLASS, WITH A SATISFACTORY/NO CREDIT (S/NC) GRADING OPTION. THE AIM OF THIS WEEKLY MEETING IS TO DISCUSS THE MOST RECENT ADVANCES IN COMPUTER SCIENCE.", "href": "/courses/view/CS-2003"}, {"id": "CS-2012", "prereqs": [], "description": "This course will cover methods and strategies that are useful for the design of nonnumeric algorithms. Students are expected to design their own algorithms.", "href": "/courses/view/CS-2012"}, {"id": "CS-2045", "prereqs": ["CS-401"], "description": "This course is an introduction to the architecture of and software techniques for parallel and high performance computing systems. The content includes fundamental architecture aspects of shared-memory and distributed-memory systems, as well as paradigms, algorithms and languages used to program parallel systems. Students will complete a number of projects demonstrating specific applications on parallel processing systems.", "href": "/courses/view/CS-2045"}, {"id": "CS-2053", "prereqs": [], "description": "This course will provide the necessary conceptual background and hands-on experience to understand the most common cryptographic algorithms and protocols and how to use them to secure computers networks and distributed applications.  Topics include: cryptographic algorithms for data confidentiality, authentication, and integrity, user authentication methods (secure tokens and biometrics), internet security protocols, security in local area networks, firewalls, and intrusion detection systems.", "href": "/courses/view/CS-2053"}, {"id": "CS-2055", "prereqs": ["CS-441"], "description": "The objective of this course is to provide an in-depth knowledge of database systems design. Thus, the emphasis is on how to model ones own data and how to use available Database Management Systems effectively. Towards this end, the relational and the object-relational models are discussed in great detail and object-oriented and other data models are also presented. Commercial database management systems are examined and students get practical experience through the use of such systems.", "href": "/courses/view/CS-2055"}, {"id": "CS-2056", "prereqs": [], "description": "This course aims to expose students to different data management, data manipulation, and data analysis techniques. The class will cover all the major data management paradigms (Relational/SQL, XML/XQuery, RDF/SPARQL) including NoSQL and Data Stream Processing approaches. Going beyond traditional data management techniques, the class will expose students to information retrieval, data mining, data warehousing, network analysis, and other data analysis topics. Time-permitting, the class will include Big Data processing techniques, such as the map/reduce framework.", "href": "/courses/view/CS-2056"}, {"id": "CS-2110", "prereqs": ["CS-1511"], "description": "This course deals with computability theory, automata theory and formal languages. Various models of computation will be examined, their relations to each other and their properties will be studied. Topics include models for computable functions and Church's thesis, models for recognizers and their relation to formal grammars, algorithmically solvable and insolvable problems, and the complexity of computations.", "href": "/courses/view/CS-2110"}, {"id": "CS-2150", "prereqs": ["CS-1510"], "description": "This course deals with the analysis of algorithms and the relevance of such analysis to the design of efficient algorithms. The derivation of results that are primarily of theoretical significance shares importance with the practical task of designing efficient algorithms. Topics covered: searching and sorting, graph algorithms, arithmetic, NP-completeness, and lower bound techniques.", "href": "/courses/view/CS-2150"}, {"id": "CS-2210", "prereqs": [], "description": "The design and implementation of current high level languages. Emphasis is placed on the structure of compilers. Lexical, syntax and semantic analyses as well as target code generation and register allocation. Storage management techniques for recursive and retentive control structures. Formal specification techniques.", "href": "/courses/view/CS-2210"}, {"id": "CS-2310", "prereqs": ["CS-1501"], "description": "This course will examine the software engineering process in general, the considerations for large software projects in particular, and then will focus on the conversion of software specifications into production code. Topics will include modern design methods; safety-critical software; verification and validation; testing theory and methods; reengineering of legacy software.", "href": "/courses/view/CS-2310"}, {"id": "CS-2410", "prereqs": ["CS-1541"], "description": "A study of the hardware structure of computer systems and subsystems. Topics include: processor architecture, parallelism and pipelining, cache and main memory organization, I/O controllers and I/O processors, and interconnection structures.", "href": "/courses/view/CS-2410"}, {"id": "CS-2450", "prereqs": ["CS-1510", "CS-1541"], "description": "The fundamental principles of parallel computing systems are studied at the architecture level, the algorithmic level and the application level. Topics of specific interest include: MPP and SMP Architectures, including Multi-cores and Many-cores, Parallel Programming Models and Paradigms, Interconnection networks, cache coherence issues, design and analysis of parallel algorithms, resource and power management, and the application of parallel systems to solve real problems.", "href": "/courses/view/CS-2450"}, {"id": "CS-2510", "prereqs": ["CS-1550"], "description": "An in-depth study of the control abstractions in modern operating systems and the issues involved in efficient implementation of those abstractions. Topics will include concurrency and its control, memory management, resource management, and structure of distributed and parallel operating systems. These topics will be developed through the lectures, assigned readings from the literature, and an examination of actual operating systems.", "href": "/courses/view/CS-2510"}, {"id": "CS-2520", "prereqs": ["CS-1652"], "description": "This course provides an understanding of the basic principles of broadband networks, an emerging technology that allows networks to run at much greater data rates and to carry diverse types of traffic in an integrated manner. It will introduce protocols suitable for broadband networks, with emphasis on asynchronous transfer mode (ATM). Other technologies, such as Frame Relay and Switched Multimegabit Data Services (SMDS), will be discussed. The course will also address important design issues for high speed networks, including characterizations of (a) network traffic and its implications on network design, and (b) application performance objectives, traffic policing, and congestion control algorithms that can meet those diverse objectives.", "href": "/courses/view/CS-2520"}, {"id": "CS-2530", "prereqs": ["CS-1550"], "description": "The goal of the proposed course is to provide our graduate students the necessary background and hands on experience to do well in systems research or advanced development with an emphasis on security. The instructor will lecture on cryptographic algorithms for data confidentiality, authentication, and integrity, security protocols for the internet and local area networks, firewalls, intrusion detection systems, defense against denial of service attacks, user authentication methods, cryptographic file systems, secure email stenography and usable security.", "href": "/courses/view/CS-2530"}, {"id": "CS-2550", "prereqs": ["CS-1555"], "description": "The main objective of this course is to provide an in-depth knowledge of Database Management Systems design. Topics covered at length are concurrency control including concurrency on structured data, recovery and query optimization. Some important aspects of distributed databases are discussed, including distributed concurrency control and fault-tolerance.", "href": "/courses/view/CS-2550"}, {"id": "CS-2610", "prereqs": ["CS-1550"], "description": "This course covers methodology for the modeling, specification, design, measurement, and evaluation of human-computer interfaces (HCI). Included topics are: interaction models and modes, conceptual/logical/physical interface structures, objectively measurable interface patterns, and criteria for interface evaluation. HCI relationships to software engineering and artificial intelligence are highlighted.", "href": "/courses/view/CS-2610"}, {"id": "CS-2620", "prereqs": ["CS-1571"], "description": "This course discusses computer graphics, modeling and visualization techniques used to solve scientific problems. Focus falls on identifying scientific problems, proposing solutions involving graphical modeling and visualization, and designing, implementing, and evaluating the solutions. Examples include interactive software systems, quantitative analysis tools, or new applications of existing visualizations methods.", "href": "/courses/view/CS-2620"}, {"id": "CS-2650", "prereqs": ["CS-1555"], "description": "The emphasis of this course is on modeling and design of distributed multimedia systems. A framework is presented for data management, multimedia information management, knowledge management, communications management, activities management, interface management and applications to distributed systems, real-time systems, multimedia systems and information retrieval systems design.", "href": "/courses/view/CS-2650"}, {"id": "CS-2710", "prereqs": ["CS-1573"], "description": "This course covers the foundational techniques in artificial intelligence, including: problem definition and analysis, heuristic search, adversarial search, knowledge representation, planning and constraint satisfaction, and methods for reasoning under uncertainty. Attention will be given to the roles of these techniques in the design of intelligent agents.", "href": "/courses/view/CS-2710"}, {"id": "CS-2731", "prereqs": ["CS-1501"], "description": "This course provides an introduction to the field of Natural Language Processing (NLP) - the creation of computer programs that can understand, generate, and learn natural language. Natural language understanding will be used as a vehicle to introduce three major subfields of NLP: syntax, semantics, and pragmatics. The course will introduce both knowledge-based and statistical methods for NLP, and will illustrate the use of such methods in a variety of application areas.", "href": "/courses/view/CS-2731"}, {"id": "CS-2740", "prereqs": [], "description": "The course will presuppose familiarity with AI programming techniques and research methods. Specific topics include: logic-based representations, semantic networks, frame-based representations, rule-based methods, object oriented methods, conceptual dependency networks, nonmonotonic reasoning, and specific issues in representation of casual, temporal, and spatial relations.", "href": "/courses/view/CS-2740"}, {"id": "CS-2750", "prereqs": ["CS-1501"], "description": "The goal of the field of machine learning is to build computer systems that learn from experience and that are capable to adapt to their environments. Learning techniques and methods developed by researchers in this field have been successfully applied to a variety of learning tasks in a broad range of areas, including, for example, text classification, gene discovery, financial forecasting, credit card fraud detection, collaborative filtering, design of adaptive web agents and others.\r\n\r\nThis introductory machine learning course will give an overview of many models and algorithms used in modern machine learning, including generalized linear models, multi-layer neural networks, support vector machines, density estimation methods, Bayesian belief networks, mixture models, clustering, ensamble methods, and reinforcement learning. The course will give the student the basic ideas and intuition behind these methods, as well as, a more formal understanding of how and why they work. Students will have an opportunity to experiment with machine learning techniques and apply them a selected problem in the context of a term project.", "href": "/courses/view/CS-2750"}, {"id": "CS-2770", "prereqs": ["CS-1501"], "description": "In this class, students will learn about modern computer vision. The first part of the course will cover fundamental concepts such as image formation and filtering, edge detection, texture description, feature extraction and matching, grouping and clustering, model fitting, and combining multiple views. A crash course in machine learning will follow, in preparation for the second course chapter on visual recognition. We will study classic and modern approaches in object detection, deep learning, mid-level representations, active, transfer, and unsupervised learning, tracking, and human pose and activity recognition. The format will include lectures, homework assignments, exams, and a course project.", "href": "/courses/view/CS-2770"}, {"id": "CS-2900", "prereqs": [], "description": "A professional internship may be taken at any time during the course of graduate study. Ph.D. students may take it at most once.", "href": "/courses/view/CS-2900"}, {"id": "CS-2910", "prereqs": [], "description": "A project under the supervision of a faculty member or a group of faculty members.", "href": "/courses/view/CS-2910"}, {"id": "CS-2990", "prereqs": [], "description": "This course involves study which is approved by the faculty advisor but carried out independently by the student.", "href": "/courses/view/CS-2990"}, {"id": "CS-3000", "prereqs": ["CS-2055"], "description": "Any adjunct or full member of the graduate faculty of the department may direct doctoral dissertations.", "href": "/courses/view/CS-3000"}, {"id": "CS-3120", "prereqs": ["CS-2110"], "description": "The purpose of this course is to present fundamental results regarding the learning capabilities of computer programs. Basic results from computation theory and logic are languages, automata theory and logic are first presented. These are then used to show the limitations and capabilities of algorithmic strategies for various learning environments including program synthesis, language acquisition, concept learning and identification of finite state machines.", "href": "/courses/view/CS-3120"}, {"id": "CS-3130", "prereqs": [], "description": "The goal of this course is to understand and apply various techniques in cryptography to problems in many aspects of computing.  Some examples are:  login, email, sharing/splitting secrets, digital signatures, and micro-cash.  Starting from basic mathematical foundation, such as hardness of some number theoretic problems, the course will cover cryptographic protocols, cryptographic techniques and cryptographic algorithms.", "href": "/courses/view/CS-3130"}, {"id": "CS-3150", "prereqs": ["CS-2150"], "description": "This course covers recent results in the design and analysis of algorithms. The contents change from term to term.", "href": "/courses/view/CS-3150"}, {"id": "CS-3210", "prereqs": ["CS-2210"], "description": "Advanced program representations and program analysis techniques for compilers, optimizers, software tools and parallel systems. Analysis techniques include advanced register allocation algorithms, data flow frameworks and techniques, optimizing algorithms and slicing techniques. Program representations include various types of dependence graphs and static single assignment. Analysis and code improving transformations for various types of parallel architectures including VLIW, superscalar, shared memory and distributed memory machines. Current research topics in programing languages.", "href": "/courses/view/CS-3210"}, {"id": "CS-3220", "prereqs": ["CS-2210"], "description": "This course will study techniques used in the design of parallelizing compilers. Techniques for computing dependencies and program representations suitable for parallelizing software will be presented. Topics will include detection of fine and coarse parallelism, program transformations and scheduling techniques to exploit parallelism on shared and distributed memory architectures, and techniques for debugging parallel software.", "href": "/courses/view/CS-3220"}, {"id": "CS-3230", "prereqs": ["CS-2210"], "description": "Continuation of compiler construction techniques including efficient code generation, register allocation, data flow analysis, and code optimization. Advanced data flow analysis techniques for programming environments and software tools. Current topics in compiler research such as program representations and array analysis techniques for high-performance architectures.", "href": "/courses/view/CS-3230"}, {"id": "CS-3410", "prereqs": ["CS-2410"], "description": "This course will survey current topics in computer architecture.", "href": "/courses/view/CS-3410"}, {"id": "CS-3510", "prereqs": ["CS-2510"], "description": "A study of specific topics of modern distributed and real-time systems, the theory behind them, and their implementation. Topics may include advanced concepts in distributed systems, wireless sensor networks, resource management in multicore and in distributed systems, and memory management, among others.", "href": "/courses/view/CS-3510"}, {"id": "CS-3520", "prereqs": ["CS-1652"], "description": "We are now on the cusp of a significant evolution in information technology, one which has the potential to completely change how computing is carried out and how information technology infrastructure is provisioned, managed and protected. This seminar will examine what cloud computing is, considering both the benefits and challenges that it brings about; and will explore future research directions and open questions in this emerging field of computing and computing infrastructure. The course will focus on the critical technology trends that are enabling cloud computing, the architecture and the design of existing deployments, the services and the applications they offer, and the challenges that needs to be addressed to help cloud computing to reach its full potential.\r\n\r\nThe format of this course will be a mix of lectures, seminar-style discussions, and student presentations. Students will be responsible for paper readings, and completing a hands-on project. Readings will be selected from recent conference proceedings and journals.", "href": "/courses/view/CS-3520"}, {"id": "CS-3521", "prereqs": ["CS-2410"], "description": "This course will focus on the fundamental issues related to designing and analyzing sensor networks and applications. Topics include but are not limited to:  driving applications for sensor nets; wireless networking issues; directed diffusion, aggregation, and data dissemination; power aware routing computing and communication; hardware and software platform and tools.", "href": "/courses/view/CS-3521"}, {"id": "CS-3525", "prereqs": ["CS-1550", "CS-1653", "CS-2530"], "description": "This course covers current research topics in computer security and privacy. The topics covered will change from term to term.", "href": "/courses/view/CS-3525"}, {"id": "CS-3530", "prereqs": ["CS-2510"], "description": "This course will introduce the students to the foundations of real-time systems. The emphasis is on understanding predictability and resource management at the level of the processor, network, memory, disks, I/O devices, etc. Fault-tolerance is another main emphasis of the course, since it is a requirement for real-time behavior. Specific real-time fault-tolerant schemes will be discussed.", "href": "/courses/view/CS-3530"}, {"id": "CS-3540", "prereqs": ["CS-2410", "CS-2520"], "description": "Topics will include algorithms and impossibility results concerning mutual exclusion, barrier synchronization, lock-free synchronization, fault-tolerance, self-stabilization, and verification of concurrent programs. Other topics to be determined according to the interests of the students.", "href": "/courses/view/CS-3540"}, {"id": "CS-3550", "prereqs": ["CS-2520"], "description": "This course is devoted to a reevaluation of traditional database techniques and the examination of emerging approaches for the reliable and efficient data management in large distributed systems. Examples of such systems include multi-databases, mobile and multimedia databases, and advanced OS and AI. Topics include object management, workflows and extended transactions, semantics-based concurrence control and recovery, active and real-time database techniques. The concept will be examined within the context of a state-of-the-art system.", "href": "/courses/view/CS-3550"}, {"id": "CS-3551", "prereqs": ["CS-2510", "CS-2550"], "description": "Nowadays, there is great interest on the topic of Big Data in the technology industry and research communities. In this seminar we will focus on the question of what is \"Big\" and why (if?) existing data processing paradigms and data management techniques fall short of meeting the new challenges. Towards answering these questions, we will study current approaches and techniques in distributed and parallel databases and data stream management systems as well as emerging data management technologies for the cloud in addressing heterogeneity, scale, timeliness, complexity, energy, and privacy challenges.", "href": "/courses/view/CS-3551"}, {"id": "CS-3555", "prereqs": ["CS-2550"], "description": "This course takes a retrospective look on technologies that are used on the web today, with particular emphasis on web data management and emerging technologies. Topics to be examined include information retrieval, information extraction, data integration over the web, quality of data and quality of service, web services, and the mobile web.", "href": "/courses/view/CS-3555"}, {"id": "CS-3570", "prereqs": [], "description": "Example topics that may be covered include (1) visual techniques and tools, including visual languages and visualization, (2) multimedia design considerations and methods, (3) adaptive approaches to design, including AI techniques. Selection of topics is dependent on instructor.", "href": "/courses/view/CS-3570"}, {"id": "CS-3580", "prereqs": ["CS-1515", "CS-1645"], "description": "Different topics related to parallel and distributed computations will be covered at various levels of details. Example of such topics are: architectures of high performance systems, general graphic processing units and other types of accelerators,  languages and programming environments for parallel and distributed systems, the design and analysis of parallel algorithms, reconfigurable and data driven processors, power management in high performance systems and resilience of large scale systems.", "href": "/courses/view/CS-3580"}, {"id": "CS-3610", "prereqs": ["CS-2620"], "description": "This class covers current topics in computer graphics with an emphasis on interdisciplinary visualization. This course includes reading and discussing current research papers and a final project done in small groups.", "href": "/courses/view/CS-3610"}, {"id": "CS-3650", "prereqs": ["CS-1520", "CS-1651"], "description": "This course covers the fundamentals of visual language theory, iconic and symbolic representation, parsing techniques, semantics and pragmatics of visual languages, visual programming programming systems, visual querying systems, visual information systems and knowledge-based visualization.", "href": "/courses/view/CS-3650"}, {"id": "CS-3710", "prereqs": ["CS-2710"], "description": "This course will survey current topics in artificial intelligence.", "href": "/courses/view/CS-3710"}, {"id": "CS-3720", "prereqs": ["CS-2710"], "description": "A practical course in expert systems involving discussions of fundamentals of building expert systems, discussion of open problems, and designing and building a protype expert system.", "href": "/courses/view/CS-3720"}, {"id": "CS-3730", "prereqs": ["CS-2731"], "description": "This course provides an introduction to the field of natural language processing (NLP). We will use natural language understanding as a vehicle to introduce the three major subfields of NLP: Syntax (which concerns itself with determining the structure of a sentence), semantics (which concerns itself with determining the explicit meaning of a single sentence), and pragmatics (which concerns itself with deriving the implicit meaning of a sentence when it is used in a specific discourse context).", "href": "/courses/view/CS-3730"}, {"id": "CS-3740", "prereqs": ["CS-2710"], "description": "The course will presuppose familiarity with AI programming techniques and research methods. Specific topics include: logic-based representations, semantic networks, frame-based representations, rule-based methods, object oriented methods, conceptual dependency networks, nonmonotonic reasoning, and specific issues in representation of casual, temporal, and spatial relations.", "href": "/courses/view/CS-3740"}, {"id": "CS-3750", "prereqs": ["CS-2750"], "description": "The goal of the field of machine learning is to build computer systems that learn from experience and that are capable to adapt to their environments. Learning techniques and methods developed by researchers in this field have been successfully applied to a variety of learning tasks in a broad range of areas, including, for example, text classification, gene discovery, financial forecasting, credit card fraud detection, collaborative filtering, design of adaptive web agents and others.\r\n\r\nThe objective of the Advanced Machine Learning course is to expand on the material covered in the introductory Machine Learning course (CS2750), and focus on the most recent advances in the ML field such as, kernel and variational methods. The course will consist of a mix of lectures, paper presentations and discussions. Students will be evaluated based on their participation in discussions, paper presentations and projects.", "href": "/courses/view/CS-3750"}, {"id": "CS-3790", "prereqs": [], "description": "Emphasis on machine pattern recognition and learning: Bayes decision theory, parameter estimation, Bayesian belief networks, discriminant functions, supervised learning, nonparametric techniques, feature extraction, principal component analysis, hidden Markov models, expectation-maximization, support vector machines, artificial neural networks, unsupervised learning, clustering, and syntactic pattern recognition.", "href": "/courses/view/CS-3790"}, {"id": "CS-3900", "prereqs": [], "description": "The course may involve a project under the supervision of a faculty member. Credits between 1-9 inclusive.", "href": "/courses/view/CS-3900"}, {"id": "FTDJ-", "prereqs": [], "description": "Allows students to be full-time students while doing their dissertation.", "href": "/courses/view/FTDJ-0000"}], "links": [{"source": "CS-7", "target": "CS-334"}, {"source": "CS-134", "target": "CS-334"}, {"source": "CS-401", "target": "CS-334"}, {"source": "CS-401", "target": "CS-445"}, {"source": "CS-445", "target": "CS-447"}, {"source": "CS-445", "target": "CS-449"}, {"source": "CS-4", "target": "CS-590"}, {"source": "CS-7", "target": "CS-590"}, {"source": "CS-8", "target": "CS-590"}, {"source": "CS-401", "target": "CS-590"}, {"source": "CS-7", "target": "CS-699"}, {"source": "CS-441", "target": "CS-1501"}, {"source": "CS-445", "target": "CS-1501"}, {"source": "CS-441", "target": "CS-1502"}, {"source": "CS-445", "target": "CS-1502"}, {"source": "CS-1501", "target": "CS-1510"}, {"source": "CS-1502", "target": "CS-1510"}, {"source": "CS-1502", "target": "CS-1511"}, {"source": "CS-445", "target": "CS-1515"}, {"source": "CS-445", "target": "CS-1520"}, {"source": "CS-445", "target": "CS-1530"}, {"source": "CS-447", "target": "CS-1538"}, {"source": "CS-447", "target": "CS-1541"}, {"source": "CS-449", "target": "CS-1541"}, {"source": "CS-447", "target": "CS-1550"}, {"source": "CS-449", "target": "CS-1550"}, {"source": "CS-441", "target": "CS-1555"}, {"source": "CS-445", "target": "CS-1555"}, {"source": "CS-447", "target": "CS-1566"}, {"source": "CS-447", "target": "CS-1566"}, {"source": "CS-441", "target": "CS-1567"}, {"source": "CS-445", "target": "CS-1567"}, {"source": "CS-1501", "target": "CS-1571"}, {"source": "CS-1502", "target": "CS-1571"}, {"source": "CS-1501", "target": "CS-1573"}, {"source": "CS-1502", "target": "CS-1573"}, {"source": "CS-441", "target": "CS-1621"}, {"source": "CS-445", "target": "CS-1621"}, {"source": "CS-441", "target": "CS-1622"}, {"source": "CS-447", "target": "CS-1622"}, {"source": "CS-1501", "target": "CS-1630"}, {"source": "CS-1520", "target": "CS-1630"}, {"source": "CS-1530", "target": "CS-1630"}, {"source": "CS-1550", "target": "CS-1630"}, {"source": "CS-1555", "target": "CS-1630"}, {"source": "CS-1566", "target": "CS-1630"}, {"source": "CS-441", "target": "CS-1631"}, {"source": "CS-445", "target": "CS-1631"}, {"source": "CS-441", "target": "CS-1632"}, {"source": "CS-445", "target": "CS-1635"}, {"source": "CS-1501", "target": "CS-1640"}, {"source": "CS-447", "target": "CS-1645"}, {"source": "CS-449", "target": "CS-1645"}, {"source": "CS-1501", "target": "CS-1645"}, {"source": "CS-1550", "target": "CS-1651"}, {"source": "CS-447", "target": "CS-1652"}, {"source": "CS-449", "target": "CS-1652"}, {"source": "CS-449", "target": "CS-1653"}, {"source": "CS-1501", "target": "CS-1653"}, {"source": "CS-441", "target": "CS-1655"}, {"source": "CS-445", "target": "CS-1655"}, {"source": "CS-1501", "target": "CS-1656"}, {"source": "CS-1501", "target": "CS-1666"}, {"source": "CS-1501", "target": "CS-1671"}, {"source": "CS-1502", "target": "CS-1671"}, {"source": "CS-1501", "target": "CS-1674"}, {"source": "CS-1501", "target": "CS-1675"}, {"source": "CS-449", "target": "CS-1900"}, {"source": "CS-1501", "target": "CS-1900"}, {"source": "CS-1501", "target": "CS-1980"}, {"source": "CS-1550", "target": "CS-1980"}, {"source": "CS-1501", "target": "CS-1981"}, {"source": "CS-1550", "target": "CS-1981"}, {"source": "CS-2000", "target": "CS-2001"}, {"source": "CS-2001", "target": "CS-2002"}, {"source": "CS-401", "target": "CS-2045"}, {"source": "CS-441", "target": "CS-2055"}, {"source": "CS-1511", "target": "CS-2110"}, {"source": "CS-1510", "target": "CS-2150"}, {"source": "CS-1501", "target": "CS-2310"}, {"source": "CS-1541", "target": "CS-2410"}, {"source": "CS-1510", "target": "CS-2450"}, {"source": "CS-1541", "target": "CS-2450"}, {"source": "CS-1550", "target": "CS-2510"}, {"source": "CS-1652", "target": "CS-2520"}, {"source": "CS-1550", "target": "CS-2530"}, {"source": "CS-1555", "target": "CS-2550"}, {"source": "CS-1550", "target": "CS-2610"}, {"source": "CS-1571", "target": "CS-2620"}, {"source": "CS-1555", "target": "CS-2650"}, {"source": "CS-1573", "target": "CS-2710"}, {"source": "CS-1501", "target": "CS-2731"}, {"source": "CS-1501", "target": "CS-2750"}, {"source": "CS-1501", "target": "CS-2770"}, {"source": "CS-2055", "target": "CS-3000"}, {"source": "CS-2110", "target": "CS-3120"}, {"source": "CS-2150", "target": "CS-3150"}, {"source": "CS-2210", "target": "CS-3210"}, {"source": "CS-2210", "target": "CS-3220"}, {"source": "CS-2210", "target": "CS-3230"}, {"source": "CS-2410", "target": "CS-3410"}, {"source": "CS-2510", "target": "CS-3510"}, {"source": "CS-1652", "target": "CS-3520"}, {"source": "CS-2410", "target": "CS-3521"}, {"source": "CS-1550", "target": "CS-3525"}, {"source": "CS-1653", "target": "CS-3525"}, {"source": "CS-2530", "target": "CS-3525"}, {"source": "CS-2510", "target": "CS-3530"}, {"source": "CS-2410", "target": "CS-3540"}, {"source": "CS-2520", "target": "CS-3540"}, {"source": "CS-2520", "target": "CS-3550"}, {"source": "CS-2510", "target": "CS-3551"}, {"source": "CS-2550", "target": "CS-3551"}, {"source": "CS-2550", "target": "CS-3555"}, {"source": "CS-1515", "target": "CS-3580"}, {"source": "CS-1645", "target": "CS-3580"}, {"source": "CS-2620", "target": "CS-3610"}, {"source": "CS-1520", "target": "CS-3650"}, {"source": "CS-1651", "target": "CS-3650"}, {"source": "CS-2710", "target": "CS-3710"}, {"source": "CS-2710", "target": "CS-3720"}, {"source": "CS-2731", "target": "CS-3730"}, {"source": "CS-2710", "target": "CS-3740"}, {"source": "CS-2750", "target": "CS-3750"}]}